---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.FamilyContextException
source: html/30924661-cece-6246-8d23-12141ab4829d.htm
---
# FamilyContextException Methods

Retrieves data needed to serialize the target object.